Repository: step-/find-n-run
Catalog: usr/share/locale/*/LC_MESSAGES/findnrun.po
Languages: de, es, fr, it

source: Findnrun
it: Ricercatore

source: application finder
it: trova applicazione

source: shell completion
it: trova comando

source: fatal source error: %d%s\n
it: errore finale sulla fonte %d%s\n

source: recoverable source error: %d%s\n
it: errore parziale sulla fonte %d%s\n

source: source warning: %d%s\n
it: attenzione alla fonte %d%s\n

source: Invalid source plugins found and disabled:\n%s
it: Trovati e disattivati plugin di fonti non valide:\n%s

source: SHOWNODISPLAY false excludes file '%s'
it: SHOWNODISPLAY falso esclude il file '%s'

source: filename '%s': Icon '%s' not found.
it: file '%s': icona '%s' non trovata.

source: _Help
de: _Hilfe
es: _Ayuda
fr: _Aide
it: _Aiuto

source: %s %s authors: %s Open source - GNU GPL license applies %s %s configuration: %s
it: %s %s autori: %s Open source - software libero sotto licenza GNU GPL %s %s configurazione: %s

source: %s application found
de: %s Anwendung gefunden
es: %s aplicación encontrada
fr: %d application trouvée
it: trovata una%.0s applicazione

source: %s source loaded
it: caricata una%.0s fonte

source: %s: invalid SAVEFLT redirection '%s'\n
it: %s: ridirezione SAVEFLT non valida '%s'\n

source: Click the status bar or press a hotkey to activate the next source.\n%s\n%s
it: Clicca la barra di stato o premi una scorciatoia di tastiera per attivare la prossima fonte.\n%s\n%s

source: Restart Findnrun?
it: Vuoi riavviare Findnrun?

source: Press ENTER to select
de: Enter-Taste selektiert
es: Presione ENTER para seleccionar
fr: Pressez ENTREE pour sélectionner
it: Seleziona premendo INVIO

source: Type some letters to refine the list
de: Eingabe von ein paar Buchstaben verkleinert die Liste sofort
es: Escriba algunas letras para refinar la lista
fr: Tapez quelques lettres pour affiner la liste
it: Raffina l'elenco battendo alcune lettere

source: Clear entry
de: Eintrag löschen
es: Limpiar entrada
fr: Effacer l'entrée
it: Pulisci campo

source: Press ENTER or double-click to run the selected item
de: Enter-Taste oder Doppel-Klick startet selektierte Anwendung
es: Pulse ENTER o haga doble clic para ejecutar el elemento seleccionado
fr: Appuyez sur ENTREE ou double-cliquez sur l'application à exécuter
it: Esegui l'elemento selezionato premendo INVIO o con un doppio clic

source: Press the Down Arrow key to grab the selected item and move through the history list. You can edit the grabbed entry. History persists while the program is running. History is cleared on exit.
it: Premi Freccia Giù per richiamare l'elemento selezionato e per consultare l'elenco storico. Gli elementi si possono modificare. Lo storico resta attivo fino alla chiusura della finestra: viene cancellato all'uscita dal programma.

source: Press Down Arrow to grab selected item
it: Premi Freccia Giù per richiamare l'elemento selezionato

source: Remove entry from history
it: Cancella l'elemento dallo storico

source: Comment about current item
de: Kommentar zu obiger Anwendung
es: Comentario sobre el elemento actual
fr: Commentaire à propos de l'élément actuel
it: Commento sull'elemento attuale

source: More...
it: Di più...

source: Keep this window open after activating an item. Keep the window open to use the history feature, or to avoid startup delays.
it: Tiene questa finestra aperta dopo l'attivazione di un elemento. Tenendo la finestra aperta si può usare lo storico e si riduce il tempo di avvio del programma.

source: _Keep window
de: Fenster _lassen
es: _Mantener ventana
fr: _Conserver la fenêtre
it: _Tieni finestra

source: Display all available icons instead of displaying just the icons that do not need to be cached. Caching all icons may take some time. Disabling this option clears the existing cache.
de: Alle verfügbaren Symbole anzeigen anstatt nur derjenigen, die nicht zwischengespeichert werden müssen. Speicherung benötigt etwas Zeit. Deaktivierung dieser Option leert den existierenden Zwischenspeicher.
es: Mostrar todos los iconos disponibles en lugar de mostrar sólo los iconos que no necesitan estar en caché. Almacenando en caché todos los iconos puede tomar algún tiempo. Al desactivar esta opción borra la caché existente.
fr: Afficher toutes les icônes disponibles au lieu d'afficher uniquement les icônes qui ne nécessitent pas d'être mis en cache. La mise en cache de toutes les icônes peut prendre un certain temps. La désactivation de cette option efface le cache existant.
it: Mostra tutte le icone delle applicazioni anziché solo le icone che non necessitano di essere memorizzate. La memorizzazione di tutte le icone potrebbe richiedere un certo tempo. Disattivare questa opzione per ripulire la memoria icone.

source: _Show all icons
de: Alle _Symbole anzeigen
es: _Mostrar todos los iconos
fr: _Afficher de petits icônes
it: _Mostra tutte le icone

source: Return the keyboard focus to the search input field after activating an item instead of keeping the keyboard focus on the activated list item.
it: Dopo l'attivazione dell'elemento riporta il cursore della tastiera nel campo ricerca, anziché lasciarlo sull'elemento selezionato nella lista.

source: _Focus search
de: _Fokus auf Suche
es: _Focalizar búsqueda
fr: _Focus de la recherche
it: Torna a _ricerca

source: About and help
de: Über und Hilfe
es: Acerca de y ayuda
fr: Aide et infos
it: Informazioni e guida

source: Exit
de: Beenden
es: Salir
fr: Quitter
it: Termina

source: Click to hide.
it: Cliccando si nasconde

source: Show also hidden system applications.
it: Mostra anche le applicazioni nascoste del sistema.

source: Show _hidden
it: Mostra _nascoste

source: Search in application names, file names, command lines, comments and categories all at once.
it: Ricerca nel contempo tra i nomi delle applicazioni, i nomi dei file, i comandi, i commenti e le categorie.

source: Search _complete
it: Ricerca _completa

source: Interpret the search pattern as a POSIX Basic regular expression.
it: Interpreta il termine di ricerca come espressione regolare POSIX Basic.

source: _Regex
it: Espressioni _regolari

source: Edit configuration file directly. Restart required for changes to take effect.*
it: Modifica direttamente il file delle configurazioni. Per attivare i cambiamenti dovrai riavviare Findnrun.

source: application finder options * = restart required
it: configurazione di 'trova applicazione' * = riavvio richiesto

source: Findnrun.
it: Ricercatore.

source: Find applications and much more.
it: Trova applicazioni e molto altro ancora.

source: Credits
it: Ringraziamenti

source: Foremost credit goes to Puppy Linux users SFR and L18L, who created the _earlier_ Find'N'Run script in Spring 2015.
it: Ringrazio principalmente SFR e L18L, utenti del forum di Puppy Linux, per aver creato il _primo_ Find'N'Run nella primavera del 2015.

source: **Desktop icon**
it: **Icona sul desktop

source: Icon Pack: Human-O2
it: Pacchetto icone: Human-O2

source: License: GNU/GPL
it: Licenza d'uso: GNU/GPL

source: Download: http://findicons.com/icon/94185/old_zoom_original
it: Scarica: http://findicons.com/icon/94185/old_zoom_original

source: **Some plugin icons**
it: **Alcune icone dei plugin**

source: [Woof-CE](https://github.com/puppylinux-woof-CE/woof-CE/tree/testing/woof-code/rootfs-skeleton/usr/share/pixmaps/puppy) Puppy build system.
it: Il sistema di costruzione di Puppy Linux [Woof-CE](https://github.com/puppylinux-woof-CE/woof-CE/tree/testing/woof-code/rootfs-skeleton/usr/share/pixmaps/puppy).

source: **Translations**
it: **Traduzioni**

source: French - ASRI, Puppy Linux forum
it: Francese - ASRI, forum di Puppy Linux

source: German - L18L, Puppy Linux forum
it: Tedesco - L18L, forum di Puppy Linux

source: Italian - xanad, [Italian](http://www.italianpuppy.org/) Puppy Linux forum
it: Italiano - xanad, forum [italiano](http://www.italianpuppy.org/) di Puppy Linux

source: Spanish - nilsonmorales, nilsonmorales@hotmail.com
it: Spagnolo - nilsonmorales, nilsonmorales@hotmail.com

source: Simplified Chinese, Traditional Chinese - icake, icake@hotmail.com
it: Cinese semplificato e tradizionale - icake, icake@hotmail.com

source: **Packages**
it: **Pacchetti**

source: Debian - Puppy Linux forum user _saintless_ helped me improve my rudimentary .deb packages for version 1.10.6. _Saintless_ and _fredx_ co-author [DebianDog](http://www.murga-linux.com/puppy/viewtopic.php?t=93225), a live CD that looks and acts like Puppy Linux but is Debian.
it: Debian - _saintless_, utente del forum di Puppy Linux, mi ha aiutato a migliorare il mio rudimentale pacchetto .deb per la versione 1.10.6. _Saintless_ e _fredx_ sono gli autori di [DebianDog](http://www..murga-linux.com/puppy/viewtopic.php?t=93225), un live CD che appare e si comporta proprio come Puppy Linux ma sotto è Debian.

source: Hotkeys
it: Tasti rapidi d'attivazione

source: **Anywhere in the main window**
it: **Ovunque nella finestra principale**

source: `[F1]` - view help documentation
it: `[F1]` - mostra la guida

source: `[F2]` - cycle keyboard focus between the history field and the search input field
it: `[F2]` - sposta a circuito chiuso il cursore della tastiera tra il campo dello storico e quello dell'inserimento ricerca

source: `[F3]` - start the next search plugin
it: `[F3]` - attiva il plugin successivo

source: `[F4]` - copy search results to file and/or clipboard ([XCLIP](preference.md) required)
it: `[F4]` - copia i risultati della ricerca in un file e/o nel blocco degli appunti (necessita [XCLIP](preference.md))

source: `[F12]` - activate the top search result item. Focus moves according to user preference 'Focus search'
it: `[F12]` - attiva l'elemento in cima all'elenco dei risultati. Il cursore si muove in accordo alla preferenza 'Torna a ricerca'

source: `[Escape]` - exit findnrun
it: `[Escape]` - termina findnrun

source: `[Page Down]` - Rotate down search result items[1]
it: `[Pagina Giù]` - ruota in basso l'elenco dei risultati di ricerca[1]

source: `[Page Up]` - Rotate up search result items[1]
it: `[Pagina Su]` - ruota in alto l'elenco dei risultati di ricerca[1]

source: `[Tab]` - cycle through user interface controls
it: `[Tabulatore]` - sposta il cursore attraverso tutti gli elementi dell'interfaccia utente

source: `[Ctrl+1]` .. `[Ctrl+9]` - start search plugin `1` through `9`. Usually `1` is findnrun's default application search.
it: `[Ctrl+1]` .. `[Ctrl+9]` - attiva il plugin corrispondente da `1` a `9`. Di solito `1` corrisponde alla ricerca applicazioni predefinita da findnrun

source: [1] Plugin only feature. Demo plugin: 'Filmstrip'. The number of lines that get rotated varies with each plugin.
it: [1] Caratteristica riservata ai plugin. Per dimostrazione il plugin: 'Filmstrip'. Il numero di linee che sono ruotate dipende da ogni specifico plugin.

source: **With the focus in the search input field**
it: **Con il cursore nel campo di inserimento ricerca**

source: `[Enter]` - move focus to the top search result item
it: `[Invio]` - sposta il cursore all'elemento in cima all'elenco dei risultati

source: **With the focus in the search result list**
it: **Con il cursore nell'elenco dei risultati

source: `[Arrow Down]` - select the next item
it: `[Freccia Giù]` - seleziona l'elemento successivo

source: `[Arrow Up]` - select the previous item
it: `[Freccia Su]` - seleziona l'elemento precedente

source: `[Enter]` - activate the current item
it: `[Invio]` - attiva l'elemento attuale

source: `[Page Down]` - Scroll up search results
it: `[Pagina Giù]` - Fa scorrere in su l'elenco dei risultati

source: `[Page Up]` - Scroll down search results
it: `[Pagina Su]` - Fa scorrere in giù l'elenco dei risultati

source: **With the focus in the history field**
it: **Con il cursore nel campo d'inserimento ricerca**

source: `[Arrow Down]` - grab the current search result selection / show the previous history item
it: `[Freccia Giù]` - richiama l'elemento selezionato / mostra l'elemento storico precedente

source: `[Arrow Up]` - show the next history item
it: `[Freccia Su]` - mostra l'elemento storico successivo

source: `[Enter]` - activate current entry text
it: `[Invio]` - attiva il testo attualmente inserito

source: `Edit keys` - edit current entry text, including a grabbed item
it: `Tasti di modifica` - agiscono sul testo attualmente inserito, compreso un risultato richiamato

source: Help Index
it: Indice della guida

source: **Findrun** - A progressive finder
it: **Findnrun** - un ricercatore progressivo

source: [Project home](http://github.com/step-/find-n-run) | [Downloads](http://github.com/step-/find-n-run/releases)
it: [Pagina del progetto](http://github.com/step-/find-n-run) | [Scaricare](http://github.com/step-/find-n-run/releases)

source: Introduction
it: Introduzione

source: Findnrun is an extensible desktop application finder. It finds and displays system applications in a graphical window. Search results are refined and displayed progressively as you type characters into the search input field. With the addition of plugins findnrun can search for other objects, such as user files, shell commands, pictures, and so on.
it: Findnrun serve a trovare le applicazioni e può andare anche ben oltre. Elenca in una finestra le applicazioni che trova. I risultati della ricerca diventano sempre più specifici mano a mano che si inseriscono delle lettere nel campo di ricerca. Se a findnrun si aggiungono delle estensioni si possono ricercare anche altri tipi di oggetti, per esempio i file, i comandi della shell, le foto, e così via.

source: Findnrun started in May 2015 as a fork of [Find'N'Run](CREDITS.md), an earlier project for Puppy Linux.
it: Findnrun è nato nel maggio 2015 come biforcazione di [Find'N'Run](CREDITS.md), il progetto originatore per Puppy Linux.

source: Currently Findnrun is being developed and tested on [Fatdog64](http://distro.ibiblio.org/fatdog/web/) 64-bit Linux, a [Puppy Linux](http://puppylinux.com/) and [LFS](http://www.linuxfromscratch.org/) derivative.
it: Attualmente Findnrun viene sviluppato e collaudato su Linux a 64 bit [Fatdog64](http://distro.ibiblio.org/fatdog/web/), un derivato di [Puppy Linux](http://puppylinux.com/) e di [Linux From Scratch](http://www.linuxfromscratch.org/).

source: To clarify the names, which can be confusing at first:
it: I nomi confondono, perciò chiariamoli in partenza:

source: _Findnrun_ - this project
it: _Findnrun_ è questo progetto

source: _find-n-run_ - this online repository
it: _find-n-run_ è il contenitore online di questo progetto

source: _Find'N'Run_ - the _earlier_ project
it: _Find'N'Run_ era il _primo_ progetto

source: Both projects name the main script 'findnrun'.
it: Entrambi i progetti chiamano il comando di avvio 'findnrun'.

source: Main features
it: Caratteristiche principali

source: **Fast incremental search** (find as you type)[1]
it: **Ricerca incrementale al volo** (trova mentre digiti)[1]

source: **Search Plugins** extend search to other data types
it: **Estensioni** che forniscono altri tipi di ricerche

source: **Command line entry** with history.
it: **Inserimento libero di comandi** con storico

source: **[Hotkeys](hotkey.md)**
it: **[Tasti rapidi d'attivazione](hotkey.md)**

source: **Browsable help**[2]
it: **Guida navigabile**[2]

source: **[User preferences](preference.md)**
it: **[Preferenze configurabili](preference.md)**

source: **Multiple-user, multiple-instance** support[3]
it: **Utenti diversi e istanze multiple** del programma sono supportati[3]

source: **Multi-language** support includes program and help documentation.
it: **Traduzioni** dell'interfaccia grafica e della guida d'uso.

source: [1] Search for applications by **name**, **filename**, **command line**, **comments**, and **categories**, or all at once. Search **from left**, with **regular expressions**, **case-independently**. Search for applications installed with **Wine**.
it: [1] Ricerca applicazioni per **nome** o **nome del file** o **commando** o **commento** o **categoria**, oppure tutti insieme. Ricerca a partire **da sinistra**, con **espressioni regolari**, ignorando **maiuscole/minuscole**. Ricerca applicazioni installate con **Wine**.

source: [2] Help documents are encoded as _markdown_. You can _read_ markdown as plain text - with some minor loss of formatting - or with the [mdview](http://chiselapp.com/user/jamesbond/repository/mdview3/index) viewer (recommended). Mdview can also _browse_ markdown, and automatically show _translated_ markdown provided that the findnrun NLS package for your language is installed.
it: [2] La guida è salvata in formato _markdown_, che si può leggere come un testo normale (con trascurabili degradazioni dell'impaginazione), ma anche con [mdview](http://chiselapp.com/user/jamesbond/repository/mdview3/index), l'apposito visualizzatore (si raccomanda). Mdview aggiunge la navigazione del testo e la sua traduzione, a patto che il pacchetto aggiuntivo 'findnrun NLS' sia stato installato per la lingua d'uso del sistema.

source: [3] Run multiple searches at the same time. Each search window is separate from other running instances. Use multiple preference files to tailor each instance to your needs.
it: [3] Esegui più ricerche insieme, separandole su istanze diverse. Ogni istanza di findnrun ha la sua finestra, che può essere adattata alla specifica esigenza definendo un suo opportuno file di preferenze.

source: Documentation Topics
it: Argomenti della guida

source: [Screenshots](screenshots.md)
it: [Immagini](screenshots.md)

source: [Installing](install.md) and Language Settings
it: [Installazione](install.md) e configurazione lingua

source: [Starting](running.md) Findnrun
it: [Avviare](running.md) findnrun

source: [Configuring](preference.md) Preferences
it: [Configurare](preference.md) le preferenze

source: [Hotkeys](hotkey.md)
it: [Tasti rapidi d'avvio](hotkey.md)

source: [Plugins](plugin.md)
it: [Estensioni](plugin.md)

source: [Reporting bugs](issues.md)
it: [Comunicare problemi](issues.md)

source: [Credits](CREDITS.md)
it: [Ringraziamenti](CREDITS.md)

source: [Translating](TRANSLATING.md)
it: [Traduzioni](TRANSLATING.md)

source: [License](LICENSE.md) GNU GPL v2
it: [Licenza d'uso](LICENSE.md) GNU GPL v2

source: Change Log
it: Storico delle versioni

source: See [release announcements](https://github.com/step-/find-n-run/releases) and - for fine-grained information - [commit history](https://github.com/step-/find-n-run/commits/master).
it: Vedi [annuncio nuova versione](https://github.com/step-/find-n-run/releases) e, per maggior dettaglio, lo [storico dei commit](https://github.com/step-/find-n-run/commits/master).

source: Links
it: Collegamenti

source: [Project home](http://github.com/step-/find-n-run)
it: [Pagina del progetto](http://github.com/step-/find-n-run)

source: [Downloads](http://github.com/step-/find-n-run/releases)
it: [Scaricare](http://github.com/step-/find-n-run/releases)

source: [Forum thread](http://www.murga-linux.com/puppy/viewtopic.php?t=102811)
it: [Discussione sul forum](http://www.murga-linux.com/puppy/viewtopic.php?t=102811)

source: [Old forum thread](http://www.murga-linux.com/puppy/viewtopic.php?t=98330)
it: [Vecchia discussione sul forum](http://www.murga-linux.com/puppy/viewtopic.php?t=98330)

source: _Next: [Starting Findnrun](running.md)_
it: _Prossimo: [Avviare findnrun](running.md)_

source: Installing
it: Installazione

source: It is recommended to install the latest full package for your distribution, which is split into multiple sub-packages:
it: Si raccomanda d'installare la versione più recente disponibile per la propria distribuzione Linux. L'installazione è suddivisa in più pacchetti:

source: The _base_ package includes the main script, its `.desktop` file, and an English help file (markdown)
it: il pacchetto _base_, che comprende il programma principale, il suo file `.desktop` e la guida inglese in formato markdown;

source: The optional _NLS_ package adds run-time translations in several languages
it: il pacchetto aggiuntivo _NLS_, che aggiunge la traduzione in varie lingue.

source: [Installation requirements](install-require.md): ash (or bash[1]), gawk, gtk-dialog.
it: [Dipendenze per l'installazione](install-require.md): ash (oppure bash[1]), gawk, gtk-dialog.

source: [1] if you only have bash on your system, you may need to do a one-time, post-install file edit. See the above link for details.
it: [1] Se il sistema offre solo bash potrebbe essere necessario modificare manualmente un file dopo l'installazione e una volta per tutte. Leggi i dettagli seguendo il collegamento riferito.

source: To read _translated_ help files the _mdview_ markdown viewer is required. While a text editor is sufficient to read English help files, installing mdview is recommended for an improved experience. Mdview is a small, single-file, GTK application that displays markdown with clickable hyperlinks and pictures.
it: Per poter leggere la guida _tradotta_ occorre avere il visualizzatore mdview. Anche se per leggere la guida inglese basta un'applicazioncina di modifica del testo, si raccomanda comunque d'installare mdview, perché migliora l'esperienza complessiva. Mdiview occupa poco spazio: è un singolo file eseguibile per GTK e aggiunge supporto alla navigazione per hyperlink e alle figure.

source: Packages
it: Pacchetti

source: Packages for various distributions can be downloaded from:
it: I pacchetti per le varia distribuzioni sono scaricabili da:

source: (1) the latest release announcement in the [releases page](http://github.com/step-/find-n-run/releases/):
it: (1) l'annuncio di ogni nuova versione nella [pagina delle versioni](http://github.com/step-/find-n-run/releases/):

source: Fatdog64 [.txz](http://github.com/step-/find-n-run/releases/)
it: per Fatdog64 [.txz](http://github.com/step-/find-n-run/releases/)

source: Puppy Linux [.pet](http://github.com/step-/find-n-run/releases/)
it: per Puppy Linux [.pet](http://github.com/step-/find-n-run/releases/)

source: Debian (Lubuntu) [.deb](https://github.com/step-/find-n-run/releases/tag/1.10.6)
it: per Debian (Lubuntu) [.deb](http://github.com/step-/find-n-run/releases/1.10.6)

source: (2) one of these known threads:
it: (2) una delle discussioni note:

source: Puppy Linux full [.pet](http://www.murga-linux.com/puppy/viewtopic.php?t=98330), which also features a ROX-app application
it: per Puppy Linux completo [.pet](http://www.murga-linux.com/puppy/viewtopic.php?t=98330), vecchia versione comprendente anche una ROX-app

source: Quirky Linux [.pet](http://www.murga-linux.com/puppy/viewtopic.php?t=99789)
it: per Quirky Linux [.pet](http://www.murga-linux.com/puppy/viewtopic.php?t=99789)

source: Language Settings
it: Configurazione della lingua

source: If the system locale is correctly configured, and the optional NLS support package is installed, which includes translations for your local language, findnrun should automatically display its messages in the local language.
it: Se il _system locale_ è stato configurato correttamente e il pacchetto aggiuntivo NLS è stato installato allora findnrun dovrebbe automaticamente apparirvi nella lingua locale del sistema.
