Repository: step-/find-n-run
Catalog: usr/share/locale/*/LC_MESSAGES/findnrun.po
Languages: de, es, fr, it

source: Moreover the search result list can display item _name_ and _comments_ in the local language provided that the corresponding `.desktop` file includes translated names and comments, which is independent of findnrun. (Item _categories_ instead are strictly single-language ,typically English, according to the freedesktop.org's desktop file specifications [ref1](http://standards.freedesktop.org/desktop-entry-spec/latest/ar01s04.html) and [ref2](http://standards.freedesktop.org/desktop-entry-spec/latest/ar01s05.html)).
it: Inoltre l'elenco dei risultati di ricerca dovrebbe mostrare il _nome_ e i _commenti_ di ogni elemento nella lingua locale, a patto che il corrispondente file `.desktop` di ogni applicazione contenga la traduzione del nome e dei commenti. Questo ultimo fatto non dipende da findnrun. Invece le _categorie_ di ogni elemento appariranno sempre in un'unica lingua, solitamente l'inglese, per quanto normato dai documenti [rif1](http://standards.freedesktop.org/desktop-entry-spec/latest/ar01s04.html) e [rif2](http://standards.freedesktop.org/desktop-entry-spec/latest/ar01s05.html)) dell'organizzazione freedesktop.org.

source: Some plugins may require you to install a separate NLS support package before they can display translated messages.
it: Alcune estensioni potrebbero richiedervi d'installare un pacchetto NLS aggiuntivo per poter mostrare la traduzione dell'estensione.

source: Requirements
it: Dipendenze per l'installazione

source: If you are using Puppy Linux, Fatdog64 or DebianDog your system should already meet the minimum requirements for findnrun. Other Debian-based distributions, such as Ubuntu and Mint, need additional packages before they can use findnrun. More information for Debian systems is available on the [project page](https://github.com/step-/find-n-run/blob/master/usr/share/doc/findnrun/DEBIAN.md)
it: Se si utilizza Puppy Linux, Fatdog64 o DebianDog il sistema dovrebbe essere già pronto per installare findnrun. Invece per altre distribuzioni Linux basate su Debian, come Ubuntu e Mint, sarà necessario installare alcuni pacchetti prima di poter usare findnrun. Maggiori informazioni per i sistemi Debian sono disponibili sulla [pagina del progetto](https://github.com/step-/find-n-run/blob/master/usr/share/doc/findnrun/DEBIAN.md).

source: Findnrun depends on the following packages:
it: Findnrun necessita dei seguenti pacchetti:

source: the **ash** shell - cf. section _Ash_ below
it: la shell **ash** - cfr. la sezione _Ash_ più avanti)

source: **mdview >2016.02.04** - indispensable to view translated help files; recommended to view English help files.
it: **mdview >2016.02.04** - indispensabile per leggere la guida tradotta; raccomandato per leggere la guida in inglese.

source: If the ash shell **is** installed, be wary that some Linux distributions link `/bin/ash` to `/bin/dash`, and dash can't run findnrun. When ash is linked to dash findnrun prints error messages to the shell such as:
it: Se la shell ash **è** installata, fare attenzione che certe distribuzioni Linux creano un collegamento tra `/bin/ash` e `/bin/dash` e dash non è sufficiente per findnrun. Quando ash è collegato a dash si rilevano messaggi di errore simili ai seguenti:

source: If the true ash shell isn't already installed you can target /bin/busybox, if available, as a symbolic link or even /bin/bash.
it: Se la vera shell ash non è installata si può provare a creare un collegamento simbolico a `/bin/busybox`, se è disponibile, oppure a `/bin/bash`.

source: To create a symbolic link run the following commands in a terminal:
it: Per creare un collegamento simbolico eseguire da Terminale:

source: If `/bin/ash` is still unavailable or linked to `/bin/dash` try changing the first line of file `/usr/bin/findnrun` to reference `/bin/bash` instead of `/bin/ash`.
it: Se ancora `/bin/ash` risultasse non disponibile oppure collegata a `/bin/dash` provare a modificare la prima linea del file `/usr/bin/findnrun` riferendosi a `/bin/bash` anziché `/bin/ash`.

source: Reporting Bugs
it: Comunicare problemi

source: Please file bugs against this script in the issues section of the [github repository](https://github.com/step-/find-n-run/issues) _and not in the Puppy Linux forum thread_. You do need a github free accont to file new issues.
it: Di preferenza utilizzare il sistema di gestione delle segnalazioni (issues) [presente su GitHub](https://github.com/step-/find-n-run/issues) _anziché la pagina di discussione nel forum di Puppy Linux_. Occorre registrarsi (è gratis) sul sito di GitHub per poter segnalare un problema.

source: Known Issues and Limitations
it: Limitazioni e problemi noti

source: Freedesktop.org's [icon theme](http://standards.freedesktop.org/icon-theme-spec) support isn't implemented. This means that if multiple icon themes are installed _findnrun_ will apply the first icon found in alphabetical order. You can work around this limitation by setting hidden user preference `ICON_DIRS`.
it: Il pieno supporto per i [temi delle icone](http://standards.freedesktop.org/icon-theme-spec) di freedesktop.org non è implementato. Significa che se c'è più di tema di icone installato _findnrun_ applicherà il primo tema che trova in ordine alfabetico. Puoi provare ad aggirare questo punto modificando il valore della preferenza nascosta `ICON_DIRS`.

source: Prioritized language preferences via environment variable `LANGUAGE` are not supported. Findnrun honors the system locale code that environment variable `LANG` displays - when a matching translation file is installed.
it: Non è supportata l'indicazione di priorità tra più lingue installate (opzione avanzata della variabile d'ambiente `LANGUAGE`). Findnrun rispetta il _system locale_ indicato dalla variabile d'ambiente `LANG` se trova il file di traduzione corrispondente.

source: Findnrun does not include the additional ROX-Filer application that the earlier Find'N'Run project has.
it: Findnrun non contiene il modulo ROX-app che il primo progetto Find'N'Run aggiungeva.

source: List of Known Plugins
it: Elenco delle estensioni note

source: To users: This list can't be complete and authoritative because there is no official registration service for findnrun plugins. However, this list is still a useful overview of what kinds of extensions are available.
it: Agli utenti: questo elenco non può essere completo ed autorevole, poiché non esiste un registro ufficiale delle estensioni di findnrun. Tuttavia l'elenco resta utile come panoramica della varietà di estensioni che sono disponibili.

source: To developers: Reserve an ID for your plugin. Send me a note and I will publish the ID in this page where other developers will be able to see it.
it: Agli sviluppatori: fatevi riservare un identificativo (ID) del vostro plugin. Basta dirmelo che lo pubblicherò in questa pagina così anche gli altri sviluppatori ne saranno informati.

source: Bundled Plugins
it: Estensioni predefinite

source: [Application search](https://github.com/step-/find-n-run) - desktop application search - `FNRstart` - 2.0.0
it: [Trava applicazione](https://github.com/step-/find-n-run) - cerca tra la applicazioni del sistema - `FNRstart` - 2.0.0

source: [Shell completion](https://github.com/step-/find-n-run) - shell command search - `FNRsc` - 2.0.0
it: [Trova comando](http://github.com/step-/find-n-run/releases) - cerca tra i comandi della shell - `FNRsc` - 2.0.0

source: Demo Plugins
it: Estensioni dimostrative

source: [Filmstrip](https://github.com/step-/find-n-run/tree/master/usr/share/doc/findnrun/examples) - progressive image search - `filmstrip` - 1.1.0
it: [Filmstrip](https://github.com/step-/find-n-run) - ricerca progressiva di immagini - `filmstrip` - 1.1.0

source: [Fuzzy Search](https://github.com/step-/find-n-run/tree/master/usr/share/doc/findnrun/examples) - approximate (fuzzy) search with agrep - `agrep_apps` - 1.0.0
it: [Fuzzy Search](https://github.com/step-/find-n-run/tree/master/usr/share/doc/findnrun/examples) - ricerca approssimata (fuzzy) con agrep - `agrep_apps` - 1.0.0

source: Contributed Plugins
it: Estensioni di altra provenienza

source: Plugins
it: Estensioni

source: [Plugin Development](plugin-dev.md) | [List of contributed plugins](plugin-list.md) | [Screenshots](screenshots.md)
it: [Sviluppare estensioni](plugin-dev.md) | [Elenco estensioni](plugin-list.md) | [Immagini](screenshots.md)

source: Plugins enable connecting new types of searches into the main window. Findnrun expands beyond its original scope of "finding and starting an application" to "finding something and doing something with it". Some plugins are bundled so you can immediately use them. Shell scripting ability suffices to write your own plugin.
it: Con le estensioni si vanno ad aggiungere nuovi tipi di ricerche alla finestra principale. Così findnrun va oltre la sua funzione originale di "trovare e lanciare le applicazioni" verso l'obiettivo più ampio di "trovare oggetti e farci qualcosa". Il pacchetto base comprende alcune estensioni già utilizzabili. Per creare nuove estensioni basta saper scrivere gli script di shell.

source: Plugin Types
it: Tipi di estensioni

source: There is just one type of plugin, the _source_ plugin. More types may be added in the future.
it: C'è un solo tipo di estensione: il tipo _fonte_. Altri tipi potranno essere aggiunti in futuro.

source: Source Plugins
it: Estensioni di tipo Fonte

source: Each source plugin - _source_ for short - does two things: it generates list items for the main window, and it processes the selected list item when the user activates the item. The _exemplar source_ is the "application search and execution" that findnrun performs in its most basic configuration. It is referred to as _source 1_ and labelled _Application Finder_.
it: Ogni 'estensione fonte', abbreviato in _fonte_, fa due cose: genera un elenco di risultati nella finestra principale; elabora l'elemento selezionato quando l'utente lo attiva. Un esempio per tutti è la funzione di "ricerca e lancio di applicazioni" che findnrun esegue nella sua configurazione base. Tale funzione è nota come _fonti 1_ e denominata _Trova applicazione_.

source: As new plugins are installed, you get source 2, source 3, etc, each source with its own distinctive label. The status bar located at the bottom of the main window shows the labels of the currently active source and of the _next_ source. You move through the source ring by pressing [F3](hotkey.md).
it: Mano a mano che si installano nuove estensioni si vanno ad aggiungere fonti numerate, 2, 3, ecc. e ogni fonte ha un proprio nome che la distingue. La barra di stato, situata in fondo alla finestra principale, mostra il nome della fonte attualmente attiva e della fonte successiva. Premento il tasto [F3](hotkey.md) ci si sposta tra le fonti.

source: In its default configuration findnrun enables the _shell completion_ plugin, which is source 2. Press `F3` in the main window to start it. Shell completion searches through all the commands in your `$PATH` variable. Be aware that most commands are meant to run in their own terminal window, which this plugin doesn't start automatically.
it: La configurazione base di findnrun attiva l'estensione _trova comando_, fonte 2. La si lancia premendo `F3` nella finestra principale. L'estensione effettua ricerche tra tutti i comandi che si raggiungono dalla variabile `$PATH`. Si noti che la maggior parte dei comandi richiede di essere all'interno di una finestra del Terminale, che findnrun non lancia automaticamente.

source: **Approximate Application Search** looks and works like the built-in application search, but it performs approximate searches that tolerate typing errors to some degree.[1]
it: **Ricerca Applicazioni Approssimata** appare e funziona come la ricerca di applicazioni predefinita, ma esegue una ricerca approssimata che, fino a un certo punto, perdona gli errori di battitura.[1]

source: [Install and help](examples/agrep_apps/index.md)
it: [Installazione e documentazione](examples/agrep_apps/index.md)

source: **Filmstrip** is an image viewer plugin for end users. As you incrementally refine the search term the Filmstrip viewer displays thumbnails of the images that match your search results. Matches are checked against image filename and caption.[2]
it: **Filmstrip** è un'estensione per utenti che vogliono visualizzare immagini. Mentre si inserisce la parola da ricercare, Filmstrip mostra progressivamente le immagini che corrispondono ai risultati. La corrispondenza viene calcolata in base al nome e alla descrizione[2] dei file delle immagini.

source: [Install and help](examples/filmstrip/index.md)
it: [Installazione e documentazione](examples/filmstrip/index.md)

source: **Notes**
it: **Note**

source: [1] Requirement: Install command `agrep`, which is found in the TRE package.
it: [1] Prerequisito: installare il comando `agrep`, che si trova nel pacchetto 'TRE'.

source: [Download links](https://github.com/step-/find-n-run/releases/2.2.0) for 32- and 64-bit pet and txz packages.
it: [Scarica](https://github.com/step-/find-n-run/releases/2.2.0) pacchetti pet e txz a 32 e 64 bit.

source: [2] Optionally searching captions needs installing package 'exiftool' for your platform.
it: [2] Per la ricerca delle descrizioni necessita installare il pacchetto opzionale 'exiftool'.

source: _Next: [Hotkeys](hotkey.md)_
it: _Prossimo: [Tasti rapidi di ricerca](hotkey.md)_

source: Configuring Preferences
it: Configurare le preferenze

source: The user preferences file is created as `$HOME/.findnrunrc` on first run.
it: Il file delle preferenze viene creato all'avvio con il percorso `$HOME/.findnrunrc`.

source: Users can specify an alternative preferences file from the shell command line:
it: Si può indicare un file alternativo lanciando dalla shell con il comando:

source: GUI Preferences
it: Preferenze dell'interfaccia grafica

source: These values can be set also from the main window:
it: I seguenti valori si possono modificare anche dalla finestra principale:

source: # Keep the main window open after activating an item.
it: # Mantieni la finestra principale aperta dopo l'attivazione di un elemento.

source: # Show and cache all application icons.
it: # Salva e visualizza tutte le icone di applicazione.

source: # Return keyboard focus to the search input field.
it: # Riporta il cursore sul campo d'inserimento ricerca.

source: # Search in application names, file names, command lines, comments and categories all at once.
it: # Ricerca nel contempo tra i nomi delle applicazioni, i nomi dei file, i comandi, i commenti e le categorie.

source: # When false and no other SEARCH* field is true search in application names only.
it: # Se vale 'false' e nessun altra impostazione SEARCH* vale 'true', si cercano solo i nomi delle applicazioni.

source: # To search in, i.e., file names only set SEARCHCOMPLETE=false SEARCHFILENAMES=true.
it: # Per cercare, per esempio, solo i nomi dei file imposta SEARCHCOMPLETE=false SEARCHFILENAMES=true.

source: # Search pattern is a POSIX Basic regular expression.
it: # Il termine di ricerca va interpretato come espressione regolare POSIX Basic

source: # Applied also to comment search and category search.
it: # Questa preferenza si applica anche alle ricerche tra i commenti e tra le categorie.

source: # Ignore the NoDisplay=true attribute value of .desktop files (not recommended).
it: # Ignora l'attributo NoDisplay=true dei file di tipo .desktop (si sconsiglia).

source: # Note: Versions up to 1.10.6 didn't have this setting and showed all files by default.
it: # Nota: fino alla version 1.10.6 questa preferenza non c'era e tutti i file .desktop venivano visualizzati sempre.

source: Hidden Preferences
it: Preferenze nascoste

source: These values aren't available from the main window. They are intended mostly for power users and custom applications:
it: I seguenti valori non sono accessibili dalla finestra principale. Sono destinati principalmente ad utenti esperti e ad uso di soluzioni particolari:

source: # Hotkey format: accel-mods':'key-sym':'accel-key
it: # Formato scorciatoie di tastiera: codice-modificatore':'simbolo-tasto':'codice-tasto (accel-mods':'key-sym':'accel-key)

source: # Pressing HOTKEY_F2 cycles keyboard input focus between the history field and the search input field.
it: # Premendo HOTKEY_F2 si sposta a circuito chiuso il cursore tra il campo dello storico e quello della ricerca.

source: # Pressing HOTKEY_F3 starts the next available source plugin.
it: # Premendo HOTKEY_F3 si avvia l'estensione di fonte successiva.

source: # Pressing HOTKEY_F4 saves+filters search results (see XCLIP)
it: # Premendo HOTKEY_F4 si salva, filtrandolo, l'elenco dei risultati.

source: # Pressing HOTKEY_F12 activates the top search result list item.
it: # Premendo HOTKEY_F12 si attiva l'elemento in cima all'elenco dei risultati.

source: # Icon cache location.
it: # Percorso della cartella di salvataggio delle icone.

source: # Extend search subject to .desktop file names.
it: # Estendi la ricerca anche ai nomi dei file di tipo .desktop

source: # Subsumed by SEARCHCOMPLETE=true.
it: # Implicitamente attivato quando SEARCHCOMPLETE=true

source: # Extend search subject to application comments.
it: # Estendi la ricerca anche ai commenti delle applicazioni.

source: # Extend search subject to application categories.
it: # Estendi la ricerca anche alle categorie delle applicazioni.

source: # Show category labels in the comment field.
it: # Mostra le categorie nel campo dei commenti.

source: # Set 'hidden' to hide category labels in the comment field.
it: # Se vale 'hidden' allora non mostra le categorie nel campo dei commenti.

source: # In search input field prepend ';' to search for category only, i.e., ';office'.
it: # Digitando ';' all'inizio del termine di ricerca si ricercano solo le categorie, es. ';office'

source: # Search pattern must match from the leftmost character.
it: # Il termine della ricerca è ancorato al primo carattere.

source: # Ignored for category search.
it: # Questa preferenza non si applica alla ricerca tra le categorie.

source: # Enforce case-dependent searching.
it: # La ricerca tiene conto delle differenze tra maiuscole e minuscole.

source: # Main window geometry, no default.
it: # Dimensioni e posizione della finestra principale; nessun valore predefinito.

source: # Command-line option --geometry=WxH+X+Y overrides this value.
it: # Questa preferenza è ignorata se findnrun parte con l'opzione --geometry=WxH+X+Y.

source: # Desktop file search directories, colon-separated list from system settings.
it: # Percorsi delle cartelle contenenti file di tipo .desktop, lista separata coi due punti da valori predefiniti dal sistema.

source: # Recursively search folders and sub-folders.
it: # Ricerca ricorsiva in cartelle e sottocartelle.

source: # Icon search directories, colon-separated list from system default settings.
it: # Percorsi delle cartelle contenenti le icone, lista separata coi due punti da valori predefiniti dal sistema.

source: # Preferred help viewing program (obsolete since version 2.0.0).
it: # Visualizzatore della guida preferito (preferenza obsoleta dalla versione 2.0.0).

source: # Set XCLIP to an alternative X clipboard copy/paste filter for hotkey F4.
it: # Imposta, con XCLIP, un filtro di copia/incolla alternativo, attivato dalla scorciatoia di tastiera F4.

source: # Default value: the xclip binary file, if it's installed.
it: # Valore predefinito: il file eseguibile xclip, se è installato.

source: # Use 'none' to disable clipboard copying; output is sent to stderr.
it: # Imposta 'none' per disattivare la copia nel blocco degli appunti: l'output viene inviato a stderr.

source: # Piping and/or redirection are also supported, .i.e.,
it: # Supporta anche pipe e ridirezione, es.

source: # Built-in sources honor this setting. Some plugins may not.
it: # Le fonti predefinite rispettano questa impostazione, ma qualche plugin potrebbe non rispettarla.

source: # Entering IBOL+IBOL makes the search input field ignore all characters to the left of IBOL+IBOL included.
it: # Inserendo IBOL+IBOL nel campo di ricerca tutti i caratteri a sinistra di IBOL+IBOL compreso saranno ignorati.

source: # This is a reserved setting; do not edit it. If you accidentally do, delete the line and restart findnrun.
it: # Questa preferenza è per uso interno: non va modificata. Se per sbaglio lo fosse cancellare la linea e riavviare findnrun.

source: See Also
it: Si veda inoltre

source: _Environment Variables_ in [Starting Findnrun](running.md).
it: _Variabili d'ambiente_ in [Avviare Findnrun](running.md).

source: _Next: [Configuring Preferences](preference.md)_
it: _Prossimo: [Configurare le preferenze](preference.md)_

source: Starting Findnrun
it: Avviare findnrun

source: Desktop Menu
it: Menù del desktop

source: Findnrun's application icon is found in the 'File System' category of your desktop menu.
it: L'icona di findnrun si trova nella categoria File System del menù del desktop.

source: Global Hotkey
it: Tasto globale di avvio rapido

source: You may find convenient to start findnrun with a global hotkey. For instance, on Fatdog64-701 Linux pressing Alt-F3 anywhere on the desktop starts findnrun.
it: È comodo lanciare findnrun con un tasto globale, cosiddetta scorciatoria di tastiera. Per esempio in Linux Fatdog64-701 findnrun si avvia premendo Alt-F3 ovunque nel desktop.

source: First Run
it: Primo avvio

source: The first time findnrun starts it creates its configuration file `.findnrunrc` in your home directory, then displays the list of desktop applications, and the status bar shows that "application finder" is the current view. Press [F3] to change the view to "shell completion", the list of shell commands. Press [Ctrl+1] to switch back to "application finder". Click the exit icon to close findnrun.
it: Al suo primo avvio findnrun crea il file di configurazione `.findnrunrc` nella cartella home dell'utente, poi visualizza l'elenco delle applicazioni trovate e la barra di stato visualizza "trova applicazione" come vista attuale. Premere [F3] per cambiare la vista a "trova comando", l'elenco dei comandi della shell. Premere [Ctrl+1] per ritornare a "trova applicazione". Cliccare l'icona di uscita per terminare findnrun.

source: Command-Line Options
it: Opzioni della linea di comando

source: Set window Width`x`Heigth and top-left corner position. You may omit `WxH` or `+X+Y`.
it: Fissa largezza`x`altezza e posizione dell'angolo superiore sinistro della finestra principale. `WxH` o `+X+Y` si possono omettere.

source: Set PERMISSIONS of the _temporary directory_ with the `chown` command. By default the directory is accessible only to the file owner (700). If you need to set less-restrictive permissions:
it: Fissa i PERMESSI d'accesso della _cartella temporanea_ tramite il comando `chown`. Il valore predefinito è 700, che dà accesso solo al proprietario della cartella. Se vi serve dare accesso più lasco:

source: Display gtkdialog's standard output, which would otherwise not be shown. This option is mostly of interest to developers and advanced users.
it: Visualizza su terminale l'output standard di gtkdialog, che altrimenti resta nascosto. Questa opzione è diretta principalmente ad utenti esperti e agli sviluppatori.
