Repository: step-/find-n-run
Catalog: usr/share/locale/*/LC_MESSAGES/findnrun.po
Languages: de, es, fr, it

source: If you need to pass advanced options to gtkdialog, like perhaps which X display to use, you need to pass them on the command-line after a `--` stop marker. Anything following `--` will be passed to gtkdialog without further inspection. Be vary that some options you pass could conflict with the way findnrun sets up gtkdialog for use. Be also aware that in some cases you might also need to specify option `--stdout`:
it: Se occorre passare direttamente qualche opzione a gtkdialog, per esempio il numero del display X da utilizzare, tale opzione deve seguire `--` sulla linea di comando. Tutto cìo che segue `--` viene passato a gtkdialog senza controllo. Si tenga conto che qualche opzione diretta a gtkdialog potrebbe interferire con la configurazione che findnrun stesso fa di gtkdialog. Si consideri anche che in certi casi sarà necessario aggiungere l'opzione `--stdout`.

source: Alternate Configuration File
it: File alternativo di configurazione

source: Specify an alternate configuration file as an environment variable:
it: Si può specificare un file alternativo tramite una variabile d'ambiente:

source: Environment Variables
it: Variabili d'ambiente

source: **Standard variables**
it: **Variabili standard**

source: Many Linux versions pre-define some of these variables in system initialization files.
it: Molte versioni di Linux predefiniscono alcune di queste variabili nei file di inizializzazione del sistema.

source: _The HTML version of the Help file has been discontinued after version 1.10.6_
it: _La guida in formato HTML non è più disponibile dopo la versione 1.10.6_

source: If the HTML Help file is installed but it does not open - or it opens in a text editor - try setting `BROWSER` to your preferred web browser. `BROWSER` can be set either as an environment variable or as a configuration preference.
it: Se la guida in formato HTML è stata installata ma non si apre, oppure si apre nel programma di modifica dei testi, provare a definire il programma di navigazione preferito utilizzando `BROWSER` come variabile d'ambiente oppure come valore di configurazione.

source: If a translation file for your local language is installed but you see English messages, you need to properly configure your system locale. Findnrun honors the language code that the environment variable `LANG` displays.
it: Se il file della traduzione di findnrun nella lingua di sistema è stato installato, ma i messaggi sono visualizzati ancora in inglese, controllare che il _system locale_ sia configurato correttamente. Findnrun considera come lingua il codice espresso dalla variabile d'ambiente `LANG`.

source: See also `LANGUAGE` in the [translation tutorial](TRANSLATING.md).
it: Si veda inoltre `LANGUAGE` nel [tutorial per traduttori](TRANSLATING.md).

source: **Specific findnrun variables**
it: **Variabili specifiche di findnrun**

source: Alternate path to the configuration file. Default value: `$HOME/.findnrunrc`.
it: Percorso del file alternativo della configurazione. Valore predefinito: `$HOME/.findnrunrc`.

source: Window geometry can be set as an environment variable, as a configuration preference, and as a command-line option - in increasing order of precedence.
it: Le dimensioni e la posizione della finestra principale si possono fissare, in ordine crescente d'importanza, con una variabile d'ambiente o con un'opzione della linea di comando.

source: Advanced setting for the save filter function. See XCLIP in [user preferences](preference.md).
it: Impostazione avanzata per la funzione di salvataggio filtrato. Vedi XCLIP in [Preferenze configurabili](preference.md).

source: Debugging aid for plugin developers and bug reports.
it: Valore per l'indagine dei problemi; ad uso degli sviluppatori e di chi deve comunicare malfunzionamenti.

source: Alternate path to the mdview markdown viewer. Findnrun opens its help files with `FNRMDVIEW`. Default value: "mdview".
it: Percorso alternativo del visualizzatore di testo _markdown_. Valore predefinito "mdview". Findnrun visualizza la sua guida con `FNRMDVIEW`.

source: See more examples in the [translation tutorial](TRANSLATING.md).
it: Si vedano altri esempi nel [tutorial per traduttori](TRANSLATING.md).

source: Screenshots
it: Immagini

source: Version 2.0.0
it: Versione 2.0.0

source: **About dialog**
it: **Dialogo informazioni**

source: ![About dialog](images/findnrun-2.0.0-about.png)
it: ![Dialogo informazioni](images/findnrun-2.0.0-about.png)

source: **Main window open on _Application Finder_ source**
it: **La finestra principale mostra la fonte _trova applicazione_**

source: ![Main window open on Application Finder source](images/findnrun-2.0.0-main.png)
it: ![La finestra principale mostra la fonte Trova Applicazione](images/findnrun-2.0.0-main.png)

source: **Main window open on _Shell Completion_ source**
it: **La finestra principale mostra la fonte _trova comando_**

source: ![Main window open on Shell Completion source](images/findnrun-2.0.0-main-shell-completion.png)
it: ![La finestra principale mostra la fonte Trova Comando](images/findnrun-2.0.0-main-shell-completion.png)

source: **Filmstrip source**
it: **Fonte Filmstrip**

source: Main window open on _Filmstrip_ source (top) and _Filmstrip_ viewer (bottom)
it: Finestra principale e fonte _Filmstrip_ (sopra); visualizzatore _Filmstrip_ (sotto)

source: ![Main window open on Filmstrip source](images/findnrun-2.0.0-main-filmstrip-1.0.png)
it: ![La finestra principale e fonte Filmstrip](images/findnrun-2.0.0-main-filmstrip-1.0.png)

source: ![Filmstrip plugin viewer window](images/filmstrip-1.0.0-viewer.pub.png)
it: ![Finestra del visualizzatore Filmstrip](images/filmstrip-1.0.0-viewer.pub.png)

source: Older Versions
it: Versioni precedenti

source: Version 1.10.6 (default window size)
it: Versione 1.10.6 (dimensione standard della finestra)

source: ![Main window](images/findnrun-1.10.6-main.pub.png)
it: ![Finestra principale](images/findnrun-1.10.6-main.pub.png)

source: ![About dialog](images/findnrun-1.10.6-about.pub.png)
it: ![Dialogo informazioni](images/findnrun-1.10.6-about.pub.png)

source: Find'N'Run
es: Buscar y ejecutar

source: %s %s authors: SFR, L18L, step Open source - GNU GPL license applies %s %s configuration: %s
de: %s %s Autoren: SFR, L18L, step Open source - GNU GPL license applies %s %s Konfiguration: %s
es: %s %s autores: SFR, L18L, step Codigo abierto - Aplica licencia GNU GPL %s %s configuración: %s
fr: %s %s Auteurs : SFR, L18L, step Open source - Licence GNU GPL %s %s Configuration : %s

source: _OK
es: _Aceptar
fr: _Valider

source: Press the up-arrow key to grab the current command and move through the command history. You can modify the command. You can enter any shell command. History persists while the window is kept open. History is cleared on exit.
de: Taste Pfeil-hoch übernimmt das Kommando zum Start der Anwendung und bewegt durch die Kommando-Historie. Man kann das Kommando modifizieren. Historie bleibt nur so lang erhalten wie das Fenster geöffnet ist.
es: Pulse la tecla de flecha hacia arriba para agarrar el comando actual y moverse a través del historial de comandos. Puede modificar el comando. Puede introducir cualquier comando de shell. El historial persiste mientras la ventana se mantiene abierta. El historial se borra al salir.
fr: Appuyez sur la touche flèche-haute pour saisir la commande en cours et utiliser l'historique des commandes. Vous pouvez modifier la commande. Vous pouvez entrer une commande shell. L'historique persiste lorsque la fenêtre est maintenue ouverte. L'historique est nettoyée à la sortie.

source: Press up-arrow key to grab command
de: Taste Pfeil-hoch übernimmt Kommando zum Start der Anwendung
es: Pulse flecha hacia para grabar comando
fr: Appuyez sur la touche flèche-haute pour récupérer une commande

source: Remove entry from command history
de: Eintrag aus Kommando-Historie entfernen
es: Remover la entrada del historial de comandos
fr: Supprimer une entrée dans l'historique des commandes

source: Keep this window open after starting an item instead of closing this window each time a command starts. Keep the window open to use the command history feature, or to avoid startup delays.
de: Dieses Fenster nach dem Start einer Anwendung offen lassen. Dann bleibt die Historie der ausgeführten Kommandos erhalten und es gibt keine Verzögerung beim Start.
es: Mantenga esta ventana abierta después de comenzar un elemento en lugar de cerrar esta ventana cada vez que un comando se inicia. Mantenga la ventana abierta para utilizar la función de historial de comandos, o para evitar retrasos de inicio.
fr: Gardez cette fenêtre ouverte après le démarrage d'un élément, au lieu de la fermer chaque fois qu'une commande commence. Gardez la fenêtre ouverte pour utiliser la fonction de l'historique des commandes, ou pour éviter les retards de démarrage.

source: Move the keyboard focus to the search input field after starting an item instead of keeping the keyboard focus on the started list item. This option also affects the command input field.
de: Den Fokus der Tastatur-Eingabe nach dem Start der Anwendung auf das Eingabesuchfeld setzen. Diese Option betrifft auch das Kommandeingabefeld.
es: Mueve el foco del teclado al campo de entrada de búsqueda después de comenzar un elemento en lugar de mantener el foco del teclado en el elemento de la lista iniciado. Esta opción también afecta el campo de entrada de comandos.
fr: Déplacer le focus clavier sur le champ de saisie de recherche après le démarrage d'un élément au lieu de garder le focus clavier sur l'élément de liste commencé. Cette option affecte aussi le champ de saisie de commande.

source: Find'N'Run
es: Buscar y ejecutar

source: Find and run applications very quickly
de: Im System installierte Anwendungen finden und starten
es: Buscar y ejecutar aplicaciones muy rápidamente
fr: Trouvez et exécuter des applications très rapidement
